k6/results/mixed-10m.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/mixed.js
        output: -

     scenarios: (100.00%) 3 scenarios, 5000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)
              * write: 1000.00 iterations/s for 30s (maxVUs: 200-1000, exec: write, gracefulStop: 30s)


running (0m01.0s), 0229/1373 VUs, 7894 complete and 0 interrupted iterations
rank    [   3% ] 0078/0585 VUs  01.0s/30s  5000.00 iters/s
top     [   3% ] 0076/0588 VUs  01.0s/30s  5000.00 iters/s
write   [   3% ] 0074/0200 VUs  01.0s/30s  1000.00 iters/s

running (0m02.0s), 0022/1373 VUs, 19117 complete and 0 interrupted iterations
rank    [   7% ] 0010/0585 VUs  02.0s/30s  5000.00 iters/s
top     [   7% ] 0010/0588 VUs  02.0s/30s  5000.00 iters/s
write   [   7% ] 0002/0200 VUs  02.0s/30s  1000.00 iters/s

running (0m03.0s), 0031/1373 VUs, 30106 complete and 0 interrupted iterations
rank    [  10% ] 0016/0585 VUs  03.0s/30s  5000.00 iters/s
top     [  10% ] 0019/0588 VUs  03.0s/30s  5000.00 iters/s
write   [  10% ] 0005/0200 VUs  03.0s/30s  1000.00 iters/s

running (0m04.0s), 0096/1373 VUs, 41034 complete and 0 interrupted iterations
rank    [  13% ] 0042/0585 VUs  04.0s/30s  5000.00 iters/s
top     [  13% ] 0045/0588 VUs  04.0s/30s  5000.00 iters/s
write   [  13% ] 0009/0200 VUs  04.0s/30s  1000.00 iters/s

running (0m05.0s), 0034/1373 VUs, 52095 complete and 0 interrupted iterations
rank    [  17% ] 0017/0585 VUs  05.0s/30s  5000.00 iters/s
top     [  17% ] 0015/0588 VUs  05.0s/30s  5000.00 iters/s
write   [  17% ] 0003/0200 VUs  05.0s/30s  1000.00 iters/s

running (0m06.0s), 0019/1373 VUs, 63110 complete and 0 interrupted iterations
rank    [  20% ] 0008/0585 VUs  06.0s/30s  5000.00 iters/s
top     [  20% ] 0008/0588 VUs  06.0s/30s  5000.00 iters/s
write   [  20% ] 0003/0200 VUs  06.0s/30s  1000.00 iters/s

running (0m07.0s), 0026/1373 VUs, 74105 complete and 0 interrupted iterations
rank    [  23% ] 0013/0585 VUs  07.0s/30s  5000.00 iters/s
top     [  23% ] 0013/0588 VUs  07.0s/30s  5000.00 iters/s
write   [  23% ] 0002/0200 VUs  07.0s/30s  1000.00 iters/s

running (0m08.0s), 0138/1373 VUs, 84992 complete and 0 interrupted iterations
rank    [  27% ] 0055/0585 VUs  08.0s/30s  5000.00 iters/s
top     [  27% ] 0055/0588 VUs  08.0s/30s  5000.00 iters/s
write   [  27% ] 0028/0200 VUs  08.0s/30s  1000.00 iters/s

running (0m09.0s), 0020/1373 VUs, 96111 complete and 0 interrupted iterations
rank    [  30% ] 0007/0585 VUs  09.0s/30s  5000.00 iters/s
top     [  30% ] 0009/0588 VUs  09.0s/30s  5000.00 iters/s
write   [  30% ] 0002/0200 VUs  09.0s/30s  1000.00 iters/s

running (0m10.0s), 0024/1373 VUs, 107106 complete and 0 interrupted iterations
rank    [  33% ] 0011/0585 VUs  10.0s/30s  5000.00 iters/s
top     [  33% ] 0011/0588 VUs  10.0s/30s  5000.00 iters/s
write   [  33% ] 0002/0200 VUs  10.0s/30s  1000.00 iters/s

running (0m11.0s), 0026/1373 VUs, 118117 complete and 0 interrupted iterations
rank    [  37% ] 0014/0585 VUs  11.0s/30s  5000.00 iters/s
top     [  37% ] 0004/0588 VUs  11.0s/30s  5000.00 iters/s
write   [  37% ] 0003/0200 VUs  11.0s/30s  1000.00 iters/s

running (0m12.0s), 0056/1373 VUs, 129074 complete and 0 interrupted iterations
rank    [  40% ] 0027/0585 VUs  12.0s/30s  5000.00 iters/s
top     [  40% ] 0025/0588 VUs  12.0s/30s  5000.00 iters/s
write   [  40% ] 0004/0200 VUs  12.0s/30s  1000.00 iters/s

running (0m13.0s), 0024/1373 VUs, 140107 complete and 0 interrupted iterations
rank    [  43% ] 0010/0585 VUs  13.0s/30s  5000.00 iters/s
top     [  43% ] 0009/0588 VUs  13.0s/30s  5000.00 iters/s
write   [  43% ] 0003/0200 VUs  13.0s/30s  1000.00 iters/s

running (0m14.0s), 0020/1373 VUs, 151110 complete and 0 interrupted iterations
rank    [  47% ] 0008/0585 VUs  14.0s/30s  5000.00 iters/s
top     [  47% ] 0009/0588 VUs  14.0s/30s  5000.00 iters/s
write   [  47% ] 0003/0200 VUs  14.0s/30s  1000.00 iters/s

running (0m15.0s), 0022/1373 VUs, 162106 complete and 0 interrupted iterations
rank    [  50% ] 0013/0585 VUs  15.0s/30s  5000.00 iters/s
top     [  50% ] 0006/0588 VUs  15.0s/30s  5000.00 iters/s
write   [  50% ] 0002/0200 VUs  15.0s/30s  1000.00 iters/s

running (0m16.0s), 0026/1373 VUs, 173104 complete and 0 interrupted iterations
rank    [  53% ] 0012/0585 VUs  16.0s/30s  5000.00 iters/s
top     [  53% ] 0012/0588 VUs  16.0s/30s  5000.00 iters/s
write   [  53% ] 0002/0200 VUs  16.0s/30s  1000.00 iters/s

running (0m17.0s), 0027/1373 VUs, 184103 complete and 0 interrupted iterations
rank    [  57% ] 0012/0585 VUs  17.0s/30s  5000.00 iters/s
top     [  57% ] 0013/0588 VUs  17.0s/30s  5000.00 iters/s
write   [  57% ] 0004/0200 VUs  17.0s/30s  1000.00 iters/s

running (0m18.0s), 1687/1761 VUs, 188453 complete and 0 interrupted iterations
rank    [  60% ] 0755/0755 VUs  18.0s/30s  5000.00 iters/s
top     [  60% ] 0767/0768 VUs  18.0s/30s  5000.00 iters/s
write   [  60% ] 0165/0238 VUs  18.0s/30s  1000.00 iters/s

running (0m19.0s), 2637/2655 VUs, 191471 complete and 0 interrupted iterations
rank    [  63% ] 1177/1178 VUs  19.0s/30s  5000.00 iters/s
top     [  63% ] 1209/1210 VUs  19.0s/30s  5000.00 iters/s
write   [  63% ] 0253/0267 VUs  19.0s/30s  1000.00 iters/s

running (0m20.0s), 3394/3501 VUs, 197322 complete and 0 interrupted iterations
rank    [  67% ] 1512/1564 VUs  20.0s/30s  5000.00 iters/s
top     [  67% ] 1573/1606 VUs  20.0s/30s  5000.00 iters/s
write   [  67% ] 0310/0331 VUs  20.0s/30s  1000.00 iters/s

running (0m21.0s), 3949/3951 VUs, 204144 complete and 0 interrupted iterations
rank    [  70% ] 1692/1693 VUs  21.0s/30s  5000.00 iters/s
top     [  70% ] 1745/1745 VUs  21.0s/30s  5000.00 iters/s
write   [  70% ] 0512/0513 VUs  21.0s/30s  1000.00 iters/s
time="2026-09-16T16:19:47Z" level=warning msg="Insufficient VUs, reached 2000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=top
time="2026-09-16T16:19:47Z" level=warning msg="Insufficient VUs, reached 2000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=rank

running (0m22.0s), 4003/4534 VUs, 206014 complete and 0 interrupted iterations
rank    [  73% ] 2000/2000 VUs  22.0s/30s  5000.00 iters/s
top     [  73% ] 2000/2000 VUs  22.0s/30s  5000.00 iters/s
write   [  73% ] 0004/0534 VUs  22.0s/30s  1000.00 iters/s

running (0m23.0s), 4237/4540 VUs, 213403 complete and 0 interrupted iterations
rank    [  77% ] 1805/2000 VUs  23.0s/30s  5000.00 iters/s
top     [  77% ] 1893/2000 VUs  23.0s/30s  5000.00 iters/s
write   [  77% ] 0540/0540 VUs  23.0s/30s  1000.00 iters/s

running (0m24.0s), 2592/4574 VUs, 224697 complete and 0 interrupted iterations
rank    [  80% ] 1216/2000 VUs  24.0s/30s  5000.00 iters/s
top     [  80% ] 1209/2000 VUs  24.0s/30s  5000.00 iters/s
write   [  80% ] 0167/0574 VUs  24.0s/30s  1000.00 iters/s

running (0m25.0s), 4112/4590 VUs, 228234 complete and 0 interrupted iterations
rank    [  83% ] 2000/2000 VUs  25.0s/30s  5000.00 iters/s
top     [  83% ] 2000/2000 VUs  25.0s/30s  5000.00 iters/s
write   [  83% ] 0110/0590 VUs  25.0s/30s  1000.00 iters/s

running (0m26.0s), 4465/4590 VUs, 233246 complete and 0 interrupted iterations
rank    [  87% ] 1997/2000 VUs  26.0s/30s  5000.00 iters/s
top     [  87% ] 1996/2000 VUs  26.0s/30s  5000.00 iters/s
write   [  87% ] 0476/0590 VUs  26.0s/30s  1000.00 iters/s

running (0m27.0s), 3242/4590 VUs, 241987 complete and 0 interrupted iterations
rank    [  90% ] 1326/2000 VUs  27.0s/30s  5000.00 iters/s
top     [  90% ] 1334/2000 VUs  27.0s/30s  5000.00 iters/s
write   [  90% ] 0582/0590 VUs  27.0s/30s  1000.00 iters/s

running (0m28.0s), 1006/4661 VUs, 254705 complete and 0 interrupted iterations
rank    [  93% ] 0326/2000 VUs  28.0s/30s  5000.00 iters/s
top     [  93% ] 0335/2000 VUs  28.0s/30s  5000.00 iters/s
write   [  93% ] 0343/0661 VUs  28.0s/30s  1000.00 iters/s

running (0m29.0s), 2336/4661 VUs, 264415 complete and 0 interrupted iterations
rank    [  97% ] 0961/2000 VUs  29.0s/30s  5000.00 iters/s
top     [  97% ] 0977/2000 VUs  29.0s/30s  5000.00 iters/s
write   [  97% ] 0403/0661 VUs  29.0s/30s  1000.00 iters/s

running (0m30.0s), 3376/4661 VUs, 273806 complete and 0 interrupted iterations
rank    [ 100% ] 1646/2000 VUs  30.0s/30s  5000.00 iters/s
top     [ 100% ] 1649/2000 VUs  30.0s/30s  5000.00 iters/s
write   [ 100% ] 0081/0661 VUs  30.0s/30s  1000.00 iters/s

     ✓ top 200
     ✓ rank 200/404
     ✓ score 200

     checks.............................: 100.00% 277696 out of 277696
     data_received......................: 770 MB  26 MB/s
     data_sent..........................: 35 MB   1.2 MB/s
     dropped_iterations.................: 52308   1731.112879/s
     http_req_blocked...................: avg=116.9µs  med=1.62µs  p(95)=8.79µs   p(99)=1.86ms   max=111.74ms
     http_req_connecting................: avg=106.93µs med=0s      p(95)=0s       p(99)=1.67ms   max=95.07ms 
   ✗ http_req_duration..................: avg=151.71ms med=3.45ms  p(95)=708.43ms p(99)=1.63s    max=1.85s   
       { expected_response:true }.......: avg=151.71ms med=3.45ms  p(95)=708.43ms p(99)=1.63s    max=1.85s   
     ✗ { name:GET /leaderboard/rank }...: avg=154.11ms med=3.46ms  p(95)=718.79ms p(99)=1.66s    max=1.85s   
     ✗ { name:GET /leaderboard/top }....: avg=154.63ms med=3.28ms  p(95)=723.91ms p(99)=1.67s    max=1.84s   
     ✗ { name:POST /score }.............: avg=128.65ms med=4.3ms   p(95)=561.46ms p(99)=991.96ms max=1.22s   
   ✓ http_req_failed....................: 0.00%   0 out of 277696
     http_req_receiving.................: avg=97.65µs  med=14.91µs p(95)=119.7µs  p(99)=546.88µs max=117.64ms
     http_req_sending...................: avg=199.98µs med=3.91µs  p(95)=113.83µs p(99)=2.12ms   max=150.48ms
     http_req_tls_handshaking...........: avg=0s       med=0s      p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...................: avg=151.42ms med=3.42ms  p(95)=705.8ms  p(99)=1.63s    max=1.85s   
     http_reqs..........................: 277696  9190.240922/s
     iteration_duration.................: avg=152.03ms med=3.51ms  p(95)=710.14ms p(99)=1.63s    max=1.85s   
     iterations.........................: 277696  9190.240922/s
     vus................................: 3373    min=16               max=4458
     vus_max............................: 4661    min=1373             max=4661


running (0m30.2s), 0000/4661 VUs, 277696 complete and 0 interrupted iterations
rank  ✓ [ 100% ] 0000/2000 VUs  30s  5000.00 iters/s
top   ✓ [ 100% ] 0000/2000 VUs  30s  5000.00 iters/s
write ✓ [ 100% ] 0000/0661 VUs  30s  1000.00 iters/s
time="2026-09-16T16:19:56Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_duration{name:GET /leaderboard/rank}, http_req_duration{name:GET /leaderboard/top}, http_req_duration{name:POST /score}' have been crossed"